[
  {
    "name": "Linette Holdiness",
    "star_rating": 5,
    "date": "2 months ago",
    "review": "Excellent service. The 2 young men explained what they would be doing. Covered all furniture, removed vents, cleaned inside ducts, cleaned vents, replaced vents, removed all covering of furniture and vacuumed all the floors. Smells so nice."
  },
  {
    "name": "Hali Hendrix",
    "star_rating": 5,
    "date": "5 months ago",
    "review": "Super pleased with the service that Klean King provided at such an affordable and reasonable price. We were so happy to come home and see the results of our basically brand new rug! They also cleaned our couch and ottoman. Definitely would recommend!"
  },
  {
    "name": "Susan Markle",
    "star_rating": 5,
    "date": "a week ago",
    "review": "They have cleaned our air ducts and the carpets. They do a great job. I highly recommend!"
  },
  {
    "name": "chassidy taylor",
    "star_rating": 5,
    "date": "4 months ago",
    "review": "(Air ducts cleaned) They were exceedingly professional and friendly. Fair pricing! Attentive. My house now smells exceptionally better and ac/heat is running better! ***Will be using again!"
  },
  {
    "name": "Wendy",
    "star_rating": 5,
    "date": "2 weeks ago",
    "review": "Very professional and did a great job getting our carpet and furniture looking good again!"
  },
  {
    "name": "Michael Farinelli",
    "star_rating": 5,
    "date": "6 months ago",
    "review": "Was extremely impressed with the team’s work ethic and attention to detail. Did an amazing job doing the task we asked and took the effort to clean up after themselves, which was refreshing to see. The team works well together, professional, and competent. Will use again!"
  },
  {
    "name": "Janet Witty",
    "star_rating": 5,
    "date": "2 months ago",
    "review": "The young men who came did a great job cleaning my dryer vent. My vent goes out to the roof of my house but they didn’t hesitate to get up there. Thanks."
  },
  {
    "name": "Kevin Lively",
    "star_rating": 5,
    "date": "4 months ago",
    "review": "They were great I called them 1 day and they worked me in the very next day and done a fantastic job I would recommend them to anyone"
  },
  {
    "name": "Angela Harrell",
    "star_rating": 5,
    "date": "3 months ago",
    "review": "I’ve used this company several times and they are always polite, on time and do a fabulous job. Their prices won’t break your pocket book either. I will continue to use them. I’d recommend their services to my friends and family as well."
  },
  {
    "name": "Melanie Boudloche",
    "star_rating": 5,
    "date": "6 months ago",
    "review": "The staff are great. Very professional. They were on time, did great work and cleaned up everything. Would definitely recommend!"
  },
  {
    "name": "Debra Smith",
    "rating": 5,
    "date": "2 months ago",
    "review": "Excellent job. Friendly staff. Pleasure doing business with you. Hope you enjoy the strawberry cake. God bless."
  },
  {
    "name": "Rose Baines",
    "rating": 5,
    "date": "8 months ago",
    "review": "Wow! I was not home when they did the vents, but when I did walk in it was such a pleasant surprise! It smelled so fresh. Was very pleased with the service and promptness. Really surprised at the vent covers being cleaned and repainted! Yall made my day! Would certainly recommend your service to anyone! Thank you!"
  },
  {
    "name": "AJ Martinez",
    "rating": 5,
    "date": "8 months ago",
    "review": "I was searching for a top quality cleaning service for a house that was a total disaster. I read about Klean King and had a good vibe. My gut feeling was correct. Lori and her team did an awesome job cleaning the house beyond expectations. Their professionalism was very much appreciated. Strongly recommended. Thanks!!"
  },
  {
    "name": "Wanda Randolph",
    "rating": 5,
    "date": "3 months ago",
    "review": "Very professional, fast and friendly service. I would recommend you to anyone. Very satisfied."
  },
  {
    "name": "Krista Kairdolf",
    "rating": 5,
    "date": "a year ago",
    "review": "These guys have hands down done the best job on carpets. I have had spots that other carpet cleaning companies didn’t remove, yet Klean King did. When I asked others to remove urine spots from my dogs’ accidents, there was always still a smell. Klean King got rid of the smell and left the carpet looking brand new."
  },
  {
    "name": "Robin Bradshaw",
    "rating": 5,
    "date": "a year ago",
    "review": "I have used Klean King several times for my business. They are prompt and super efficient. The gentlemen who came to clean the carpet explained everything they were going to do and worked very quickly. They were both very friendly and professional. I wouldn't use anyone else!"
  },
  {
    "name": "EUGENE THORNTON",
    "rating": 5,
    "date": "3 months ago",
    "review": "The men that came and done the work were very understanding and worked great as a team. Love y'all!"
  },
  {
    "name": "Annette Harrison",
    "rating": 5,
    "date": "5 months ago",
    "review": "They did a great job cleaning my air ducts. Very professional and courteous."
  },
  {
    "name": "Alyssa Tamburo",
    "rating": 5,
    "date": "a year ago",
    "review": "These people are the absolute sweetest! From the scheduling to the actual service - sweet and amazing. They’re extremely timely, kind, and actually affordable. They do an amazing job with cleaning sofas (I have two dogs and cream-colored, cloth furniture) and carpets. 10/10 will always recommend them over any other company."
  },
  {
    "name": "Teresa Ogumnuyiwa",
    "rating": 5,
    "date": "11 months ago",
    "review": "They were early, very professional, did a wonderful job with my carpet. I didn’t think my carpet could be salvaged but they made it look brand new. I definitely would recommend them to everyone!!!!!!"
  },
  {
    "name": "Cindy Medlin",
    "rating": 5,
    "date": "9 months ago",
    "review": "Technicians were great. Very polite, professional and took time to answer all my questions. Would definitely recommend Klean King to others."
  },
  {
    "name": "Dee Davis",
    "rating": 5,
    "date": "a year ago",
    "review": "Very prompt and professional. Was so pleased with their work. Finally my house smells great and we aren’t breathing in that nasty dust. Would highly recommend them."
  },
  {
    "name": "Kimberly Edwards",
    "rating": 5,
    "date": "7 months ago",
    "review": "I have been calling Klean King for two years to clean the carpets and upholstery in our home. I am very satisfied with the service!"
  },
  {
    "name": "Phyllis Holmes",
    "rating": 5,
    "date": "2 months ago",
    "review": "Employees were efficient and courteous. No mess was left behind!"
  },
  {
    "name": "Megan Wilson",
    "rating": 5,
    "date": "a year ago",
    "review": "The guys from Klean Kings were wonderful. I used this company for air duct cleaning. They were friendly, professional, and cleaned up thoroughly after they were done. I’ll definitely be using this company in the future."
  },
  {
    "name": "John J",
    "rating": 5,
    "date": "11 months ago",
    "review": "Guys were right on time, very professional and did a great job cleaning! Very detailed during job and also when cleaning up after themselves! Very reasonable on pricing too."
  },
  {
    "name": "Misty Powell",
    "rating": 5,
    "date": "3 years ago",
    "review": "We absolutely love Klean King and their staff. They come and service several of our properties including my 280 unit property. They have always done an amazing job. They are very professional and pay close attention to detail. They are so easy to work with and always accommodating to our schedule. I wouldn’t use anyone else!"
  },
  {
    "name": "Mary Margaret Simmons",
    "rating": 5,
    "date": "a year ago",
    "review": "These guys are great. The other carpet cleaning service I used for many years had let me down. I called Klean King. They came right out and did a great job. I highly recommend them."
  },
  {
    "name": "Rosie Richard",
    "rating": 5,
    "date": "8 months ago",
    "review": "The Technician were on time and very professional. My Carpet looked new and my room smelled so fresh after the cleaning."
  },
  {
    "name": "Lejuana Bryan",
    "rating": 5,
    "date": "2 years ago",
    "review": "I want to say a very special thank you to Klean king for the great job their two young men did. They cleaned my duct cleaned my carpets and cleaned up after themselves. You need any cleaning done this is the company you need to call."
  },
  {
    "name": "Linda Turner",
    "rating": 5,
    "date": "11 months ago",
    "review": "The service was professional and thorough. The property closed up for years, and the cleaning brought life back. Both crews were outstanding."
  },
  {
    "name": "Beth Heatherly",
    "rating": 5,
    "date": "a year ago",
    "review": "Pickup and delivery was super convenient and on time. Large area rug was cleaned quickly. Price was reasonable and employees were polite and professional. It’s so nice to have a clean rug again!"
  },
  {
    "name": "Andrew Hicks",
    "rating": 5,
    "date": "4 months ago",
    "review": "Very friendly and professional. Highly recommend!"
  },
  {
    "name": "Mary Tellis",
    "rating": 5,
    "date": "10 months ago",
    "review": "They were there early and was very professional. My carpet looked brand new. Highly satisfied with the job they did."
  },
  {
    "name": "Vushonda Jenkins",
    "rating": 5,
    "date": "a year ago",
    "review": "They do a great job. I have used them to clean my air ducts also. Very nice and professional. It doesn’t take them long to do the job. Thank you."
  },
  {
    "name": "Toya Mitchell",
    "rating": 5,
    "date": "10 months ago",
    "review": "I went online to get& have someone come to our resident for carpet cleaning…I hit the quote button and it direct me to call the number..someone (sound like an old white man) answers and says can you call back tomorrow, I’m trying to watch TV. I did. Service was scheduled, then rescheduled, then canceled. Unprofessional, no one would have wanted to come to their place of business."
  },
  {
    "name": "Lauren Moore",
    "rating": 5,
    "date": "2 years ago",
    "review": "Great Service and my furniture looks like new!! The only reason I didn’t give 5 stars is they were about an hour later than scheduled. But they did a great job!"
  },
  {
    "name": "Tracey Philley",
    "rating": 5,
    "date": "8 months ago",
    "review": "No duct work done but did an excellent job on cleaning & polishing floors"
  },
  {
    "name": "Michael Cordova",
    "rating": 5,
    "date": "a year ago",
    "review": "I had my house cleaned and my ducts done. They did an amazing job, and I love how fresh and clean my house smells. They are so friendly and affordable. Definitely recommend them to everyone."
  },
  {
    "name": "Shawn Watson",
    "rating": 5,
    "date": "3 months ago",
    "review": "Very friendly and professional service! Did a great job!"
  },
  {
    "name": "Ronald Cutrer",
    "rating": 5,
    "date": "2 years ago",
    "review": "We had Klean King clean our carpet in the house we just bought. They did a great job! They came out quickly and were very professional! I highly recommend!"
  },
  {
    "name": "Lecia Hardy",
    "rating": 5,
    "date": "a year ago",
    "review": "Super friendly and professional service. I would definitely use them again!"
  },
  {
    "name": "Jo Beth Springer",
    "rating": 5,
    "date": "a year ago",
    "review": "They were very professional and friendly. My carpet looks and smells new. I would recommend them to everyone!"
  },
  {
    "name": "Sherise Freeman",
    "rating": 5,
    "date": "a year ago",
    "review": "Very polite and professional. Great service and great pricing."
  },
  {
    "name": "Angela O.",
    "rating": 5,
    "date": "2 years ago",
    "review": "Extremely professional. I was extremely impressed with the care and attention to detail that Klean King took when cleaning my rugs. Their pricing is very reasonable, and I would definitely use them again."
  },
  {
    "name": "Yolanda Powell",
    "rating": 5,
    "date": "2 years ago",
    "review": "They were on time, very professional, did a great job. I would recommend them to anyone."
  },
  {
    "name": "Danielle Jackson",
    "rating": 5,
    "date": "a year ago",
    "review": "Great experience from start to finish. They were easy to work with and did a fantastic job."
  }
]
